[
    {
        "title": "Rose Bien Aime",
        "commit": "Dr. Draesel is absolutely the best chiropractor and physical therapist here in Miami. I feel blessed to have found this incredible team who have taken such good care of me. Just a month ago, after my accident, I couldn't use my right shoulder at all. But now, thanks to the doctor's dedication in finding the best treatment for me, the pain has completely gone. The staff is not only very nice but also incredibly helpful. I can't thank them enough. 🙏",
        "star": 5,
        "href": "https://www.google.com/maps/contrib/105291245942154642444?hl=en-GB&ved=1t:31294&ictx=111"
    },
    {
        "title": "Jerry Fetty",
        "commit": "I recently sought treatment at Innovative Medical Wellness, and I’m beyond impressed. Dr. Jeffrey G. Draesel Jr., DC—Dr. Jeff—is truly exceptional. His warm and friendly demeanor immediately puts you at ease, and it’s clear he genuinely cares about helping his patients heal and thrive. What amazed me most was how quickly Dr. Jeff could assess my issue and pinpoint exactly what was going on. From the very first day, I saw a noticeable improvement in both pain and mobility. Dr. Jeff used a combination of advanced therapies, including Low-Level Laser Therapy (LLLT), Acoustic Wave Therapy (AWT), Pulsed Electromagnetic Field Therapy (PEMF), hands-on manipulation, and personalized instruction on avoiding repeat issues and self-care techniques. His vast wealth of healthcare knowledge is unparalleled, and he shared it in a way that empowered me to take control of my health. The entire staff was incredibly friendly, and the open, welcoming atmosphere made every visit a positive experience. Dr. Jeff is a rare find—his approach is not only highly effective but also compassionate and educational. If you’re looking for a knowledgeable, approachable, and hands-on practitioner who truly has your best interests at heart, I highly recommend Dr. Jeff and the team at Innovative Medical Wellness!🙂",
        "star": 5,
        "href": "https://www.google.com/maps/contrib/116039590559850956951?hl=en-GB&ved=1t:31294&ictx=111"
    },
    {
        "title": "Stuart Tomlin",
        "commit": "I recently visited the clinic for regenerative therapy for a litany of injuries and ailments including arthritis, soft tissue damage and chronic fatigue. The level of knowledge here of regenerative medicine, hormone optimisation and physiotherapy/rehabilitation puts the UK to shame. Cutting-edge techniques, high-end equipment and a friendly and hugely capable team left me certain this was the best decision I've made with regards to my healthcare.",
        "star": 5,
        "href": "https://www.google.com/maps/contrib/109145827206768617094?hl=en-GB&ved=1t:31294&ictx=111"
    },
    {
        "title": "Lucretia Walter",
        "commit": "Dr Draesel and staff were great! Professional  and courteous and extemely caring.had a pinched nerves and his treatment had immediate relieving effects along with strategic advice to avoid more problems and follow up therapeutic exercises .highly recommend",
        "star": 5,
        "href": "https://www.google.com/maps/contrib/109963545217399336279?hl=en-GB&ved=1t:31294&ictx=111"
    },
    {
        "title": "Kory Kula",
        "commit": "The staff was INCREDIBLE!  They were all extremely knowledgeable and talented.  They were very attentive to all my concerns and needs. I would HIGHLY recommend Innovative Medical to anyone searching for a better, healthier lifestyle!",
        "star": 5,
        "href": "https://www.google.com/maps/contrib/105232017798474880528?hl=en-GB&ved=1t:31294&ictx=111"
    },
    {
        "title": "Raul Guerrero",
        "commit": "Can't say enough good things about IMW! After two bicycle accidents – one resulting in a herniated disk and the other with a fractured rib and shoulder injury – Jeff and the crew were true lifesavers. From the moment I walked in, I felt like part of their family. The staff was not only knowledgeable but also showed genuine care and empathy throughout my treatment. They tailored a specialized plan for each of my injuries, ensuring I received the right therapies and exercises to alleviate my pain and promote healing. It wasn't just about quick fixes; they focused on long-term recovery and gave me valuable advice on managing my recovery at home. Highly recommended to anyone seeking exceptional medical care. You won't be disappointed!",
        "star": 5,
        "href": "https://www.google.com/maps/contrib/103275465814200742297?hl=en-GB&ved=1t:31294&ictx=111"
    },
    {
        "title": "Adriana Fajardo",
        "commit": "Dr Draesel is the best Chiropractor and Physical Therapist . His expertise and exceptional ability to diagnose and treat the root cause of the problem make him an exceptional practitioner. Thank you Draesel and everyone in the office for taking such good care of my and my family",
        "star": 5,
        "href": "https://www.google.com/maps/contrib/113142864311794000392?hl=en-GB&ved=1t:31294&ictx=111"
    },
    {
        "title": "Michelle Kalous",
        "commit": "Amazing people performing amazing medicine, rehab and chiropractic with current technology. Love these guys.",
        "star": 5,
        "href": "https://www.google.com/maps/contrib/103386198741017588225?hl=en-GB&ved=1t:31294&ictx=111"
    },
    {
        "title": "Adam S",
        "commit": "Outstanding clinic - the care, attention, and treatment I recieved from Dr. Draesel and team was top tier.",
        "star": 5,
        "href": "https://www.google.com/maps/contrib/108563916764631322077?hl=en-GB&ved=1t:31294&ictx=111"
    },
    {
        "title": "Cat J",
        "commit": "Dr. Draesel is unequivocally the best physical therapist and chiropractor in Miami. With over a decade of dedicated care, he's been my unwavering ally in conquering a multitude of sports-related injuries. As an avid athlete, his intimate understanding of the human body is second to none. His boundless passion and profound expertise are truly exceptional!",
        "star": 5,
        "href": "https://www.google.com/maps/contrib/115629319126593901302?hl=en-GB&ved=1t:31294&ictx=111"
    },
    {
        "title": "k shaw",
        "commit": "Omg since my first vitamin treatment IV I will never go to another Dr. My whole life improved. I call him Dr Feelgood, they cured my sciatica i have so much energy I am so healthy i literally feel like i am 42 and not 72. He is a blessing from heaven.",
        "star": 5,
        "href": "https://www.google.com/maps/contrib/113774449198815387291?hl=en-GB&ved=1t:31294&ictx=111"
    }
]